In [1]:
# !pip install mysql-connector

In [2]:
import mysql.connector #importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
  database = "class414python"
)
db = database.cursor()

In [6]:
# select

In [3]:
# Selecting rows and view data
db.execute("SELECT * FROM student")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram Prasad', 78, 79, 89, 67, 90, 400, 80.0, 'A')
(2, 'Shyam ', 89, 67, 98, 67, 34, 420, 82.0, 'A')
(3, 'Shyam ', 89, 67, 98, 67, 34, 420, 82.0, 'A')
(4, 'Sameer', 0, 0, 0, 0, 0, 0, 0.0, 'F')
(5, 'Sameer', 100, 90, 80, 80, 90, 450, 86.0, 'F')

In [4]:
db.execute("SELECT sn,name,total,grade FROM student")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram Prasad', 400, 'A')
(2, 'Shyam ', 420, 'A')
(3, 'Shyam ', 420, 'A')
(4, 'Sameer', 0, 'F')
(5, 'Sameer', 450, 'F')

In [5]:
db.execute("SELECT * FROM student WHERE grade = 'A'")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram Prasad', 78, 79, 89, 67, 90, 400, 80.0, 'A')
(2, 'Shyam ', 89, 67, 98, 67, 34, 420, 82.0, 'A')
(3, 'Shyam ', 89, 67, 98, 67, 34, 420, 82.0, 'A')

In [8]:
# Insert data
sql = '''INSERT INTO `student` (`sn`, `name`, `physics`, `chemistry`, `math`, `english`, `nepali`, `total`, `per`, `grade`) 
VALUES ('6', 'Nabina', '78', '76', '90', '65', '78', '91', '82.5', 'A')'''
db.execute(sql)
database.commit()

In [10]:
name = input("Enter name = ")
physics = int(input("Enter physics marks = "))
chemistry = int(input("Enter physics chemistry = "))
math = int(input("Enter physics math = "))
english = int(input("Enter english marks = "))
nepali = int(input("Enter physics nepali = "))
total = physics+chemistry+math+english+nepali
per = total/5
if per >= 80:
    grade = 'A'
elif per >=60:
    grade = 'B'
elif per >= 45:
    grade = 'C'
else:
    grade = 'D'
    
sql = f'''INSERT INTO student (name, physics, chemistry, math, english, nepali, total, per, grade) 
VALUES ('{name}', {physics}, {chemistry}, {math}, {english}, {nepali}, {total}, {per}, '{grade}')'''
db.execute(sql)
database.commit()

Enter name = Rabin
Enter physics marks = 89
Enter physics chemistry = 78
Enter physics math = 98
Enter english marks = 67
Enter physics nepali = 90

In [11]:
sql = "UPDATE student SET name = 'Rabina' , grade = 'B' WHERE name = 'Rabin'"
db.execute(sql)
database.commit()

In [12]:
sql = "DELETE FROM student WHERE sn = 5"
db.execute(sql)
database.commit()